src/cfe/КСП/InformationRegisters/ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП</Name>
			<Comment>На основании этих данных отдельным регл заданием создаются перемещения товаров</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПеремещениеТоваровРозница</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриходныйОрдерНаТоварыРозница</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузкиИзЕРП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияПеремещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОшибкаСоздания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОшибки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗаказа</Name>
					<Comment>заказ на перемещение в виде "Заказа №111 от 11.11.11"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеРО</Name>
					<Comment>расходный ордер в виде "Расходный ордер №111 от 11.11.11"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаПеремещениеГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РасходныйОрдерГУИД</Name>
					<Comment>гуид из ЕРП</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП/Ext/ManagerModule.bsl
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ЗафиксироватьСозданиеПеремещения(
		ВнешняяСистема, 
		ЗаказНаПеремещениеГУИД, 
		РасходныйОрдерГУИД, 
		ПеремещениеТоваровСсылка) Экспорт
		
		
	Мен_ = РегистрыСведений.ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП.СоздатьМенеджерЗаписи();
	Мен_.ВнешняяСистема = ВнешняяСистема;
	Мен_.ЗаказНаПеремещениеГУИД = ЗаказНаПеремещениеГУИД;
	Мен_.РасходныйОрдерГУИД = РасходныйОрдерГУИД;
	Мен_.Прочитать();
	Если Мен_.Выбран() Тогда
		Мен_.ПеремещениеТоваровРозница = ПеремещениеТоваровСсылка;
		Мен_.ДатаСозданияПеремещения = ТекущаяДатаСеанса();
		Мен_.Записать();
	КонецЕсли;
		
КонецПроцедуры


// Фиксирует загрузку документа РасходныйОрдерНаТовары из ЕРП 
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ДобавитьЗапись(ЗаказНаПеремещениеГУИД, 
	РасходныйОрдерГУИД,
	ВнешняяСистема,
	ПредставлениеЗаказа = "",
	ПредставлениеРО = "") Экспорт
	
	
	НЗ = РегистрыСведений.ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП.СоздатьНаборЗаписей();
	НЗ.Отбор.ВнешняяСИстема.Установить(ВнешняяСистема);
	НЗ.Отбор.ЗаказНаПеремещениеГУИД.Установить(ЗаказНаПеремещениеГУИД);
	НЗ.Отбор.РасходныйОрдерГУИД.Установить(РасходныйОрдерГУИД);
	
	НовСтр = НЗ.Добавить();
	НовСтр.ВнешняяСистема = ВнешняяСистема;
	НовСтр.ЗаказНаПеремещениеГУИД = ЗаказНаПеремещениеГУИД;
	НовСтр.РасходныйОрдерГУИД = РасходныйОрдерГУИД;
	НовСтр.ДатаЗагрузкиИзЕРП = ТекущаяДатаСеанса();
	
	Если НЕ ПредставлениеЗаказа = "" Тогда
		НовСтр.ПредставлениеЗаказа = ПредставлениеЗаказа;
	КонецЕсли;
	
	Если НЕ ПредставлениеРО = "" Тогда
		НовСтр.ПредставлениеРО = ПредставлениеРО;
	КонецЕсли;
	
	НЗ.Записать();
	
		
КонецПроцедуры



// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ГуидЗаказаПоПеремещению(ПеремещениеТоваровСсылка)Экспорт    
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Рег.ЗаказНаПеремещениеГУИД КАК ЗаказНаПеремещениеГУИД
		|ИЗ
		|	РегистрСведений.ксп_ИсточникДанныхДляПеремещенийТоваровИзЕРП КАК Рег
		|ГДЕ
		|	Рег.ПеремещениеТоваровРозница = &ПеремещениеТоваровСсылка";
	
	Запрос.УстановитьПараметр("ПеремещениеТоваровСсылка", ПеремещениеТоваровСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.ЗаказНаПеремещениеГУИД;
	КонецЦикла;
			
	Возврат "";
	
КонецФункции
